%Задание 1 вариант 2
clear all;
clc;
P=1000;
r=0.07;
a=0.2;
b=0.5;
t=1:0.1:30;
f=((P*exp(r*t))/(1+a*sin(b*t)))+log10(t.^2+1); %Информационный показатель инвестиционного процесса с инфляционной модуляцией
plot(f, t);

%Задание 2
A=[1 2 4 3 5; 8 3 1 4 6; 1 2 4 7 5; 4 6 2 3 6; 3 0 1 4 2];
B=[0 1 1 2 1; 1 2 1 0 2; 1 1 1 0 2; 2 2 2 0 0; 1 1 2 1 0];
i = 3;
j = 2;
k = 4;
r=0.95;
A(i, j)
A(i, :)
A(:, j)
A(j:5, k:5)
A(1, 1) = 4;
A(1, 5) = 0
C=A+B
D=r*C

clear all;
%Повтор simulink
%w1=(10*p^2 + 5*p + 1)/(20*p^3+p);
%w2=(5*p+1)/((10*p+1)^2);
w1=tf([10 5 1], [20 0 1 0])
step(w1, 100)
grid on;
grid minor;

w2=tf([5, 1], [100, 20, 1])
step(w2, 100)